#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Bubibi/netmemo-dev/runs/run-H6Hau7KJf9dHKWeK

Waiting for the plan to start...

Terraform v1.0.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # nsxt_policy_tier1_gateway.tier1_gw will be created
  + resource "nsxt_policy_tier1_gateway" "tier1_gw" {
      + default_rule_logging      = false
      + description               = "Tier-1 provisioned by Terraform"
      + display_name              = "T1-TFC"
      + edge_cluster_path         = (known after apply)
      + enable_firewall           = true
      + enable_standby_relocation = false
      + failover_mode             = "PREEMPTIVE"
      + force_whitelisting        = false
      + id                        = (known after apply)
      + ipv6_dad_profile_path     = (known after apply)
      + ipv6_ndra_profile_path    = (known after apply)
      + nsx_id                    = (known after apply)
      + path                      = (known after apply)
      + pool_allocation           = "ROUTING"
      + revision                  = (known after apply)
      + route_advertisement_types = [
          + "TIER1_CONNECTED",
        ]

      + intersite_config {
          + fallback_site_paths = (known after apply)
          + primary_site_path   = (known after apply)
          + transit_subnet      = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @netmemo, Action: `pull_request`*